Masmiseim36/nxpSDK/boards/mimxrt700evk/sdmmc_examples/mmccard_freertos/cm33_core0/pin_mux.c
    const uint32_t port7_pin8_config = (/* Pin is configured as SDHC0_DATA2 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-up function */
                                        IOPCTL_PIO_PULLUP_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN8 (coords: C6) is configured as SDHC0_DATA2 */
    IOPCTL_PinMuxSet(7U, 8U, port7_pin8_config);

    const uint32_t port7_pin9_config = (/* Pin is configured as SDHC0_DATA3 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-up function */
                                        IOPCTL_PIO_PULLUP_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN9 (coords: A6) is configured as SDHC0_DATA3 */
    IOPCTL_PinMuxSet(7U, 9U, port7_pin9_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
